MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_RXF0S Bits */
/* MCAN_RXF0S[F0FL] Bits */
#define MCAN_RXF0S_F0FL_OFS                      (0)                             /* !< F0FL Offset */
#define MCAN_RXF0S_F0FL_MASK                     ((uint32_t)0x0000007FU)         /* !< Rx FIFO 0 Fill Level. Number of
                                                                                    elements stored in Rx FIFO 0, range 0
                                                                                    to 64. */
/* MCAN_RXF0S[F0GI] Bits */
#define MCAN_RXF0S_F0GI_OFS                      (8)                             /* !< F0GI Offset */
#define MCAN_RXF0S_F0GI_MASK                     ((uint32_t)0x00003F00U)         /* !< Rx FIFO 0 Get Index. Rx FIFO 0 read
                                                                                    index pointer, range 0 to 63. */
/* MCAN_RXF0S[F0PI] Bits */
#define MCAN_RXF0S_F0PI_OFS                      (16)                            /* !< F0PI Offset */
#define MCAN_RXF0S_F0PI_MASK                     ((uint32_t)0x003F0000U)         /* !< Rx FIFO 0 Put Index. Rx FIFO 0
                                                                                    write index pointer, range 0 to 63. */
/* MCAN_RXF0S[F0F] Bits */
#define MCAN_RXF0S_F0F_OFS                       (24)                            /* !< F0F Offset */
#define MCAN_RXF0S_F0F_MASK                      ((uint32_t)0x01000000U)         /* !< Rx FIFO 0 Full   0  Rx FIFO 0 not
                                                                                    full   1  Rx FIFO 0 full */
/* MCAN_RXF0S[RF0L] Bits */
#define MCAN_RXF0S_RF0L_OFS                      (25)                            /* !< RF0L Offset */
#define MCAN_RXF0S_RF0L_MASK                     ((uint32_t)0x02000000U)         /* !< Rx FIFO 0 Message Lost. This bit is
                                                                                    a copy of interrupt flag IR.RF0L.
                                                                                    When IR.RF0L is reset, this bit is
                                                                                    also reset.   0  No Rx FIFO 0 message
                                                                                    lost   1  Rx FIFO 0 message lost,
                                                                                    also set after write attempt to Rx
                                                                                    FIFO 0 of size zero   Note:
                                                                                    Overwriting the oldest message when
                                                                                    RXF0C.F0OM = '1' will not set this
                                                                                    flag. */

/* MCAN_RXF0A Bits */
/* MCAN_RXF0A[F0AI] Bits */
#define MCAN_RXF0A_F0AI_OFS                      (0)                             /* !< F0AI Offset */
#define MCAN_RXF0A_F0AI_MASK                     ((uint32_t)0x0000003FU)         /* !< Rx FIFO 0 Acknowledge Index. After
                                                                                    the Host has read a message or a
                                                                                    sequence of messages from Rx FIFO 0
                                                                                    it has to write the buffer index of
                                                                                    the last element read from Rx FIFO 0
                                                                                    to F0AI. This will set the Rx FIFO 0
                                                                                    Get Index RXF0S.F0GI to F0AI + 1 and
                                                                                    up2025-10-01 the FIFO 0 Fill Level
                                                                                    RXF0S.F0FL. */

/* MCAN_RXBC Bits */
/* MCAN_RXBC[RBSA] Bits */
#define MCAN_RXBC_RBSA_OFS                       (2)                             /* !< RBSA Offset */
#define MCAN_RXBC_RBSA_MASK                      ((uint32_t)0x0000FFFCU)         /* !< Rx Buffer Start Address. Configures
                                                                                    the start address of the Rx Buffers
                                                                                    section in the Message RAM (32-bit
                                                                                    word address).   +I466 */

/* MCAN_RXF1C Bits */
/* MCAN_RXF1C[F1SA] Bits */
#define MCAN_RXF1C_F1SA_OFS                      (2)                             /* !< F1SA Offset */
#define MCAN_RXF1C_F1SA_MASK                     ((uint32_t)0x0000FFFCU)         /* !< Rx FIFO 1 Start Address Start
                                                                                    address of Rx FIFO 1 in Message RAM
                                                                                    (32-bit word address). */
/* MCAN_RXF1C[F1S] Bits */
#define MCAN_RXF1C_F1S_OFS                       (16)                            /* !< F1S Offset */
#define MCAN_RXF1C_F1S_MASK                      ((uint32_t)0x007F0000U)         /* !< Rx FIFO 1 Size. The Rx FIFO 1
                                                                                    elements are indexed from 0 to F1S -
                                                                                    1.   0      No Rx FIFO 1   1-64
                                                                                    Number of Rx FIFO 1 elements   >64
                                                                                    Values greater than 64 are
                                                                                    interpreted as 64   Qualified Write
                                                                                    is possible only with CCCR.CCE='1'
                                                                                    and CCCR.INIT='1'. */
/* MCAN_RXF1C[F1WM] Bits */
#define MCAN_RXF1C_F1WM_OFS                      (24)                            /* !< F1WM Offset */
#define MCAN_RXF1C_F1WM_MASK                     ((uint32_t)0x7F000000U)         /* !< Rx FIFO 1 Watermark   0
                                                                                    Watermark interrupt disabled   1-64
                                                                                    Level for Rx FIFO 1 watermark
                                                                                    interrupt (IR.RF1W)   >64   Watermark
                                                                                    interrupt disabled   Qualified Write
                                                                                    is possible only with CCCR.CCE='1'
                                                                                    and CCCR.INIT='1'. */
/* MCAN_RXF1C[F1OM] Bits */
#define MCAN_RXF1C_F1OM_OFS                      (31)                            /* !< F1OM Offset */
#define MCAN_RXF1C_F1OM_MASK                     ((uint32_t)0x80000000U)         /* !< FIFO 1 Operation Mode. FIFO 1 can
                                                                                    be operated in blocking or in
                                                                                    overwrite mode.   0  FIFO 1 blocking
                                                                                    mode   1  FIFO 1 overwrite mode
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */

/* MCAN_RXF1S Bits */
/* MCAN_RXF1S[F1FL] Bits */
#define MCAN_RXF1S_F1FL_OFS                      (0)                             /* !< F1FL Offset */
#define MCAN_RXF1S_F1FL_MASK                     ((uint32_t)0x0000007FU)         /* !< Rx FIFO 1 Fill Level. Number of
                                                                                    elements stored in Rx FIFO 1, range 0
                                                                                    to 64. */
/* MCAN_RXF1S[F1GI] Bits */
#define MCAN_RXF1S_F1GI_OFS                      (8)                             /* !< F1GI Offset */
#define MCAN_RXF1S_F1GI_MASK                     ((uint32_t)0x00003F00U)         /* !< Rx FIFO 1 Get Index. Rx FIFO 1 read
                                                                                    index pointer, range 0 to 63. */
/* MCAN_RXF1S[F1PI] Bits */
#define MCAN_RXF1S_F1PI_OFS                      (16)                            /* !< F1PI Offset */
#define MCAN_RXF1S_F1PI_MASK                     ((uint32_t)0x003F0000U)         /* !< Rx FIFO 1 Put Index. Rx FIFO 1
                                                                                    write index pointer, range 0 to 63. */
/* MCAN_RXF1S[F1F] Bits */
#define MCAN_RXF1S_F1F_OFS                       (24)                            /* !< F1F Offset */
#define MCAN_RXF1S_F1F_MASK                      ((uint32_t)0x01000000U)         /* !< Rx FIFO 1 Full   0  Rx FIFO 1 not
                                                                                    full   1  Rx FIFO 1 full */
/* MCAN_RXF1S[RF1L] Bits */
#define MCAN_RXF1S_RF1L_OFS                      (25)                            /* !< RF1L Offset */
#define MCAN_RXF1S_RF1L_MASK                     ((uint32_t)0x02000000U)         /* !< Rx FIFO 1 Message Lost. This bit is
                                                                                    a copy of interrupt flag IR.RF1L.
                                                                                    When IR.RF1L is reset, this bit is
                                                                                    also reset.   0  No Rx FIFO 1 message
                                                                                    lost   1  Rx FIFO 1 message lost,
                                                                                    also set after write attempt to Rx
                                                                                    FIFO 1 of size zero   Note:
                                                                                    Overwriting the oldest message when
                                                                                    RXF1C.F1OM = '1' will not set this
                                                                                    flag. */
/* MCAN_RXF1S[DMS] Bits */
#define MCAN_RXF1S_DMS_OFS                       (30)                            /* !< DMS Offset */
#define MCAN_RXF1S_DMS_MASK                      ((uint32_t)0xC0000000U)         /* !< Debug Message Status   00  Idle
                                                                                    state, wait for reception of debug
                                                                                    messages   01  Debug message A
                                                                                    received   10  Debug messages A, B
                                                                                    received   11  Debug messages A, B, C
                                                                                    received */

/* MCAN_RXF1A Bits */
/* MCAN_RXF1A[F1AI] Bits */
#define MCAN_RXF1A_F1AI_OFS                      (0)                             /* !< F1AI Offset */
#define MCAN_RXF1A_F1AI_MASK                     ((uint32_t)0x0000003FU)         /* !< Rx FIFO 1 Acknowledge Index. After
                                                                                    the Host has read a message or a
                                                                                    sequence of messages from Rx FIFO 1
                                                                                    it has to write the buffer index of
                                                                                    the last element read from Rx FIFO 1
                                                                                    to F1AI. This will set the Rx FIFO 1
                                                                                    Get Index RXF1S.F1GI to F1AI + 1 and
                                                                                    up2025-10-01 the FIFO 1 Fill Level
                                                                                    RXF1S.F1FL. */

/* MCAN_RXESC Bits */
/* MCAN_RXESC[F0DS] Bits */
#define MCAN_RXESC_F0DS_OFS                      (0)                             /* !< F0DS Offset */
#define MCAN_RXESC_F0DS_MASK                     ((uint32_t)0x00000007U)         /* !< Rx FIFO 0 Data Field Size   000  8
                                                                                    byte data field   001  12 byte data
                                                                                    field   010  16 byte data field   011
                                                                                    20 byte data field   100  24 byte
                                                                                    data field   101  32 byte data field
                                                                                    110  48 byte data field   111  64
                                                                                    byte data field   Note: In case the
                                                                                    data field size of an accepted CAN
                                                                                    frame exceeds the data field size
                                                                                    configured for the matching Rx Buffer
                                                                                    or Rx FIFO, only the number of bytes
                                                                                    as configured by RXESC are stored to
                                                                                    the Rx Buffer resp. Rx FIFO element.
                                                                                    The rest of the frame's data field is
                                                                                    ignored.   Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_RXESC[F1DS] Bits */
#define MCAN_RXESC_F1DS_OFS                      (4)                             /* !< F1DS Offset */
#define MCAN_RXESC_F1DS_MASK                     ((uint32_t)0x00000070U)         /* !< Rx FIFO 1 Data Field Size   000  8
                                                                                    byte data field   001  12 byte data
                                                                                    field   010  16 byte data field   011
                                                                                    20 byte data field   100  24 byte
                                                                                    data field   101  32 byte data field
                                                                                    110  48 byte data field   111  64
                                                                                    byte data field   Note: In case the
                                                                                    data field size of an accepted CAN
                                                                                    frame exceeds the data field size
                                                                                    configured for the matching Rx Buffer
                                                                                    or Rx FIFO, only the number of bytes
                                                                                    as configured by RXESC are stored to
                                                                                    the Rx Buffer resp. Rx FIFO element.
                                                                                    The rest of the frame's data field is
                                                                                    ignored.   Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* MCAN_RXESC[RBDS] Bits */
#define MCAN_RXESC_RBDS_OFS                      (8)                             /* !< RBDS Offset */
#define MCAN_RXESC_RBDS_MASK                     ((uint32_t)0x00000700U)         /* !< Rx Buffer Data Field Size   000  8
                                                                                    byte data field   001  12 byte data
                                                                                    field   010  16 byte data field   011
                                                                                    20 byte data field   100  24 byte
                                                                                    data field   101  32 byte data field
                                                                                    110  48 byte data field   111  64
                                                                                    byte data field   Note: In case the
                                                                                    data field size of an accepted CAN
                                                                                    frame exceeds the data field size
                                                                                    configured for the matching Rx Buffer
                                                                                    or Rx FIFO, only the number of bytes
                                                                                    as configured by RXESC are stored to
                                                                                    the Rx Buffer resp. Rx FIFO element.
                                                                                    The rest of the frame's data field is
                                                                                    ignored.   Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */

