MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TXBCF Bits */
/* MCAN_TXBCF[CF0] Bits */
#define MCAN_TXBCF_CF0_OFS                       (0)                             /* !< CF0 Offset */
#define MCAN_TXBCF_CF0_MASK                      ((uint32_t)0x00000001U)         /* !< Cancellation Finished 0.   Each Tx
                                                                                    Buffer has its own Cancellation
                                                                                    Finished bit. The bits are set when
                                                                                    the corresponding TXBRP bit is
                                                                                    cleared after a cancellation was
                                                                                    requested via TXBCR. In case the
                                                                                    corresponding TXBRP bit was not set
                                                                                    at the point of cancellation, CF is
                                                                                    set immediately. The bits are reset
                                                                                    when a new transmission is requested
                                                                                    by writing a '1' to the corresponding
                                                                                    bit of register TXBAR.   0  No
                                                                                    transmit buffer cancellation   1
                                                                                    Transmit buffer cancellation finished */
/* MCAN_TXBCF[CF1] Bits */
#define MCAN_TXBCF_CF1_OFS                       (1)                             /* !< CF1 Offset */
#define MCAN_TXBCF_CF1_MASK                      ((uint32_t)0x00000002U)         /* !< Cancellation Finished 1. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF2] Bits */
#define MCAN_TXBCF_CF2_OFS                       (2)                             /* !< CF2 Offset */
#define MCAN_TXBCF_CF2_MASK                      ((uint32_t)0x00000004U)         /* !< Cancellation Finished 2. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF3] Bits */
#define MCAN_TXBCF_CF3_OFS                       (3)                             /* !< CF3 Offset */
#define MCAN_TXBCF_CF3_MASK                      ((uint32_t)0x00000008U)         /* !< Cancellation Finished 3. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF4] Bits */
#define MCAN_TXBCF_CF4_OFS                       (4)                             /* !< CF4 Offset */
#define MCAN_TXBCF_CF4_MASK                      ((uint32_t)0x00000010U)         /* !< Cancellation Finished 4. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF5] Bits */
#define MCAN_TXBCF_CF5_OFS                       (5)                             /* !< CF5 Offset */
#define MCAN_TXBCF_CF5_MASK                      ((uint32_t)0x00000020U)         /* !< Cancellation Finished 5. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF6] Bits */
#define MCAN_TXBCF_CF6_OFS                       (6)                             /* !< CF6 Offset */
#define MCAN_TXBCF_CF6_MASK                      ((uint32_t)0x00000040U)         /* !< Cancellation Finished 6. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF7] Bits */
#define MCAN_TXBCF_CF7_OFS                       (7)                             /* !< CF7 Offset */
#define MCAN_TXBCF_CF7_MASK                      ((uint32_t)0x00000080U)         /* !< Cancellation Finished 7. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF8] Bits */
#define MCAN_TXBCF_CF8_OFS                       (8)                             /* !< CF8 Offset */
#define MCAN_TXBCF_CF8_MASK                      ((uint32_t)0x00000100U)         /* !< Cancellation Finished 8. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF9] Bits */
#define MCAN_TXBCF_CF9_OFS                       (9)                             /* !< CF9 Offset */
#define MCAN_TXBCF_CF9_MASK                      ((uint32_t)0x00000200U)         /* !< Cancellation Finished 9. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF10] Bits */
#define MCAN_TXBCF_CF10_OFS                      (10)                            /* !< CF10 Offset */
#define MCAN_TXBCF_CF10_MASK                     ((uint32_t)0x00000400U)         /* !< Cancellation Finished 10. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF11] Bits */
#define MCAN_TXBCF_CF11_OFS                      (11)                            /* !< CF11 Offset */
#define MCAN_TXBCF_CF11_MASK                     ((uint32_t)0x00000800U)         /* !< Cancellation Finished 11. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF12] Bits */
#define MCAN_TXBCF_CF12_OFS                      (12)                            /* !< CF12 Offset */
#define MCAN_TXBCF_CF12_MASK                     ((uint32_t)0x00001000U)         /* !< Cancellation Finished 12. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF13] Bits */
#define MCAN_TXBCF_CF13_OFS                      (13)                            /* !< CF13 Offset */
#define MCAN_TXBCF_CF13_MASK                     ((uint32_t)0x00002000U)         /* !< Cancellation Finished 13. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF14] Bits */
#define MCAN_TXBCF_CF14_OFS                      (14)                            /* !< CF14 Offset */
#define MCAN_TXBCF_CF14_MASK                     ((uint32_t)0x00004000U)         /* !< Cancellation Finished 14. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF15] Bits */
#define MCAN_TXBCF_CF15_OFS                      (15)                            /* !< CF15 Offset */
#define MCAN_TXBCF_CF15_MASK                     ((uint32_t)0x00008000U)         /* !< Cancellation Finished 15. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF16] Bits */
#define MCAN_TXBCF_CF16_OFS                      (16)                            /* !< CF16 Offset */
#define MCAN_TXBCF_CF16_MASK                     ((uint32_t)0x00010000U)         /* !< Cancellation Finished 16. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF17] Bits */
#define MCAN_TXBCF_CF17_OFS                      (17)                            /* !< CF17 Offset */
#define MCAN_TXBCF_CF17_MASK                     ((uint32_t)0x00020000U)         /* !< Cancellation Finished 17. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF18] Bits */
#define MCAN_TXBCF_CF18_OFS                      (18)                            /* !< CF18 Offset */
#define MCAN_TXBCF_CF18_MASK                     ((uint32_t)0x00040000U)         /* !< Cancellation Finished 18. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF19] Bits */
#define MCAN_TXBCF_CF19_OFS                      (19)                            /* !< CF19 Offset */
#define MCAN_TXBCF_CF19_MASK                     ((uint32_t)0x00080000U)         /* !< Cancellation Finished 19. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF20] Bits */
#define MCAN_TXBCF_CF20_OFS                      (20)                            /* !< CF20 Offset */
#define MCAN_TXBCF_CF20_MASK                     ((uint32_t)0x00100000U)         /* !< Cancellation Finished 20. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF21] Bits */
#define MCAN_TXBCF_CF21_OFS                      (21)                            /* !< CF21 Offset */
#define MCAN_TXBCF_CF21_MASK                     ((uint32_t)0x00200000U)         /* !< Cancellation Finished 21. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF22] Bits */
#define MCAN_TXBCF_CF22_OFS                      (22)                            /* !< CF22 Offset */
#define MCAN_TXBCF_CF22_MASK                     ((uint32_t)0x00400000U)         /* !< Cancellation Finished 22. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF23] Bits */
#define MCAN_TXBCF_CF23_OFS                      (23)                            /* !< CF23 Offset */
#define MCAN_TXBCF_CF23_MASK                     ((uint32_t)0x00800000U)         /* !< Cancellation Finished 23. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF24] Bits */
#define MCAN_TXBCF_CF24_OFS                      (24)                            /* !< CF24 Offset */
#define MCAN_TXBCF_CF24_MASK                     ((uint32_t)0x01000000U)         /* !< Cancellation Finished 24. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF25] Bits */
#define MCAN_TXBCF_CF25_OFS                      (25)                            /* !< CF25 Offset */
#define MCAN_TXBCF_CF25_MASK                     ((uint32_t)0x02000000U)         /* !< Cancellation Finished 25. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF26] Bits */
#define MCAN_TXBCF_CF26_OFS                      (26)                            /* !< CF26 Offset */
#define MCAN_TXBCF_CF26_MASK                     ((uint32_t)0x04000000U)         /* !< Cancellation Finished 26. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF27] Bits */
#define MCAN_TXBCF_CF27_OFS                      (27)                            /* !< CF27 Offset */
#define MCAN_TXBCF_CF27_MASK                     ((uint32_t)0x08000000U)         /* !< Cancellation Finished 27. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF28] Bits */
#define MCAN_TXBCF_CF28_OFS                      (28)                            /* !< CF28 Offset */
#define MCAN_TXBCF_CF28_MASK                     ((uint32_t)0x10000000U)         /* !< Cancellation Finished 28. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF29] Bits */
#define MCAN_TXBCF_CF29_OFS                      (29)                            /* !< CF29 Offset */
#define MCAN_TXBCF_CF29_MASK                     ((uint32_t)0x20000000U)         /* !< Cancellation Finished 29. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF30] Bits */
#define MCAN_TXBCF_CF30_OFS                      (30)                            /* !< CF30 Offset */
#define MCAN_TXBCF_CF30_MASK                     ((uint32_t)0x40000000U)         /* !< Cancellation Finished 30. See
                                                                                    description for bit 0. */
/* MCAN_TXBCF[CF31] Bits */
#define MCAN_TXBCF_CF31_OFS                      (31)                            /* !< CF31 Offset */
#define MCAN_TXBCF_CF31_MASK                     ((uint32_t)0x80000000U)         /* !< Cancellation Finished 31. See
                                                                                    description for bit 0. */

